seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_AIODIO0</name>
      <baseAddress>0x400CC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Analog Digital Input Output Controller (AUX_AIODIO) controls the general purpose input output pins of the AUX domain. These pins are referenced as AUXIO and can:
- be connected to analog AUX modules, such as comparators and ADC.
- connect to the asynchronous AUX event bus.

Enabled digital inputs are synchronized at SCE clock rate.

Note that the IO mapping in the AUX domain is different from the IO mapping in the MCU domain. This means that  AUXIO[n] does not map to DIO[n].</description>
      <registers>
        <register>
          <name>IOMODE</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Input Output Mode

This register controls pull-up, pull-down, and output mode for AUXIO that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>IO7</name>
              <description>[15:14] Selects mode for AUXIO[8i+7].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 7 is 0:
- If GPIODOUT bit 7 is 0: AUXIO[8i+7] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 7 is 1: AUXIO[8i+7] is driven high.

When IOPOE bit 7 is 1:
- If signal selected by IO7PSEL.SRC is 0: AUXIO[8i+7] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO7PSEL.SRC is 1: AUXIO[8i+7] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 7 is 0:
- If GPIODOUT bit 7 is 0: AUXIO[8i+7] is driven low.
- If GPIODOUT bit 7 is 1: AUXIO[8i+7] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 7 is 1:
- If signal selected by IO7PSEL.SRC is 0: AUXIO[8i+7] is driven low.
- If signal selected by IO7PSEL.SRC is 1: AUXIO[8i+7] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 7 is 0: AUXIO[8i+7] is enabled for analog signal transfer.

When GPIODIE bit 7 is 1: AUXIO[8i+7] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 7 is 0: GPIODOUT bit 7 drives AUXIO[8i+7].

When IOPOE bit 7 is 1: The signal selected by IO7PSEL.SRC drives AUXIO[8i+7].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO6</name>
              <description>[13:12] Selects mode for AUXIO[8i+6].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 6 is 0:
- If GPIODOUT bit 6 is 0: AUXIO[8i+6] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 6 is 1: AUXIO[8i+6] is driven high.

When IOPOE bit 6 is 1:
- If signal selected by IO6PSEL.SRC is 0: AUXIO[8i+6] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO6PSEL.SRC is 1: AUXIO[8i+6] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 6 is 0:
- If GPIODOUT bit 6 is 0: AUXIO[8i+6] is driven low.
- If GPIODOUT bit 6 is 1: AUXIO[8i+6] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 6 is 1:
- If signal selected by IO6PSEL.SRC is 0: AUXIO[8i+6] is driven low.
- If signal selected by IO6PSEL.SRC is 1: AUXIO[8i+6] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 6 is 0: AUXIO[8i+6] is enabled for analog signal transfer.

When GPIODIE bit 6 is 1: AUXIO[8i+6] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 6 is 0: GPIODOUT bit 6 drives AUXIO[8i+6].

When IOPOE bit 6 is 1: The signal selected by IO6PSEL.SRC drives AUXIO[8i+6].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO5</name>
              <description>[11:10] Selects mode for AUXIO[8i+5].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 5 is 0:
- If GPIODOUT bit 5 is 0: AUXIO[8i+5] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 5 is 1: AUXIO[8i+5] is driven high.

