seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
When GPIODIE bit 2 is 0: AUXIO[8i+2] is enabled for analog signal transfer.

When GPIODIE bit 2 is 1: AUXIO[8i+2] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 2 is 0: GPIODOUT bit 2 drives AUXIO[8i+2].

When IOPOE bit 2 is 1: The signal selected by IO2PSEL.SRC drives AUXIO[8i+2].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO1</name>
              <description>[3:2] Select mode for AUXIO[8i+1].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 1 is 0:
- If GPIODOUT bit 1 is 0: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 1 is 1: AUXIO[8i+1] is driven high.

When IOPOE bit 1 is 1:
- If signal selected by IO1PSEL.SRC is 0: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO1PSEL.SRC is 1: AUXIO[8i+1] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 1 is 0:
- If GPIODOUT bit 1 is 0: AUXIO[8i+1] is driven low.
- If GPIODOUT bit 1 is 1: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 1 is 1:
- If signal selected by IO1PSEL.SRC is 0: AUXIO[8i+1] is driven low.
- If signal selected by IO1PSEL.SRC is 1: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 1 is 0: AUXIO[8i+1] is enabled for analog signal transfer.

When GPIODIE bit 1 is 1: AUXIO[8i+1] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 1 is 0: GPIODOUT bit 1 drives AUXIO[8i+1].

When IOPOE bit 1 is 1: The signal selected by IO1PSEL.SRC drives AUXIO[8i+1].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO0</name>
              <description>[1:0] Select mode for AUXIO[8i+0].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 0 is 0:
- If GPIODOUT bit 0 is 0: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 0 is 1: AUXIO[8i+0] is driven high.

When IOPOE bit 0 is 1:
- If signal selected by IO0PSEL.SRC is 0: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO0PSEL.SRC is 1: AUXIO[8i+0] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 0 is 0:
- If GPIODOUT bit 0 is 0: AUXIO[8i+0] is driven low.
- If GPIODOUT bit 0 is 1: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 0 is 1:
- If signal selected by IO0PSEL.SRC is 0: AUXIO[8i+0] is driven low.
- If signal selected by IO0PSEL.SRC is 1: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 0 is 0: AUXIO[8i+0] is enabled for analog signal transfer.

When GPIODIE bit 0 is 1: AUXIO[8i+0] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 0 is 0: GPIODOUT bit 0 drives AUXIO[8i+0].

When IOPOE bit 0 is 1: The signal selected by IO0PSEL.SRC drives AUXIO[8i+0].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIODIE</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>General Purpose Input Output Digital Input Enable

This register controls input buffers for AUXIO that are controlled by instance i of AUX_AIODIO.  Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7_0</name>
              <description>[7:0] Write 1 to bit index n in this bit vector to enable digital input buffer for AUXIO[8i+n].
Write 0 to bit index n in this bit vector to disable digital input buffer for AUXIO[8i+n].

You must enable the digital input buffer for AUXIO[8i+n] to read the pin value in GPIODIN.
You must disable the digital input buffer for analog input or pins that float to avoid current leakage.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IOPOE</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Input Output Peripheral Output Enable

