seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+0] when IOPOE bit 0 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO1PSEL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Input Output 1 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+1] when IOPOE bit 1 is 1.

To avoid glitches on AUXIO[8i+1] you must configure this register while IOPOE bit 1 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+1] when IOPOE bit 1 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO2PSEL</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Input Output 2 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+2] when IOPOE bit 2 is 1.

To avoid glitches on AUXIO[8i+2] you must configure this register while IOPOE bit 2 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+2] when IOPOE bit 2 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO3PSEL</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Input Output 3 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+3] when IOPOE bit 3 is 1.

To avoid glitches on AUXIO[8i+3] you must configure this register while IOPOE bit 3 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+3] when IOPOE bit 3 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO4PSEL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Input Output 4 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+4] when IOPOE bit 4 is 1.

To avoid glitches on AUXIO[8i+4] you must configure this register while IOPOE bit 4 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+4] when IOPOE bit 4 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO5PSEL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Input Output 5 Peripheral Select

