seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
This register selects a peripheral signal that connects to AUXIO[8i+5] when IOPOE bit 5 is 1.

To avoid glitches on AUXIO[8i+5] you must configure this register while IOPOE bit 5 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+5] when IOPOE bit 5 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO6PSEL</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Input Output 6 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+6] when IOPOE bit 6 is 1.

To avoid glitches on AUXIO[8i+6] you must configure this register while IOPOE bit 6 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+6] when IOPOE bit 6 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO7PSEL</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Input Output 7 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+7] when IOPOE bit 7 is 1.

To avoid glitches on AUXIO[8i+7] you must configure this register while IOPOE bit 7 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+7] when IOPOE bit 7 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_AIODIO3</name>
      <baseAddress>0x400CF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Analog Digital Input Output Controller (AUX_AIODIO) controls the general purpose input output pins of the AUX domain. These pins are referenced as AUXIO and can:
- be connected to analog AUX modules, such as comparators and ADC.
- connect to the asynchronous AUX event bus.

Enabled digital inputs are synchronized at SCE clock rate.

Note that the IO mapping in the AUX domain is different from the IO mapping in the MCU domain. This means that  AUXIO[n] does not map to DIO[n].</description>
      <registers>
        <register>
          <name>IOMODE</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Input Output Mode

This register controls pull-up, pull-down, and output mode for AUXIO that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>IO7</name>
              <description>[15:14] Selects mode for AUXIO[8i+7].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

