seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
When DMACTL.EN = 1 :
   Event = UDMA0 Channel 7 done event     OR     AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW

When DMACTL.EN = 0 :
   Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR      AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW

Bit 7 in UDMA0:DONEMASK must be 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>[9:9] AUX_ANAIF ADC conversion done event.
Event is synchronized at AUX bus rate.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUX_ISRC_RESET_N</name>
              <description>[8:8] AUX_ANAIF:ISRCCTL.RESET_N</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>[7:7] AUX_TDC:STAT.DONE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>[6:6] AUX_TIMER0_EV event, see AUX_TIMER01:T0TARGET for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>[5:5] AUX_TIMER1_EV event, see AUX_TIMER01:T1TARGET for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[4:0] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACTL</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Direct Memory Access Control</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>REQ_MODE</name>
              <description>[2:2] UDMA0 Request mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <value>1</value>
                  <description>Single requests are generated on UDMA0 channel 7 when the condition configured in SEL is met.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <value>0</value>
                  <description>Burst requests are generated on UDMA0 channel 7 when the condition configured in SEL is met.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>[1:1] uDMA ADC interface enable.

0: Disable UDMA0 interface to ADC.
1: Enable UDMA0 interface to ADC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[0:0] Select FIFO watermark level required to trigger a UDMA0 transfer of ADC FIFO data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>1</value>
                  <description>UDMA0 trigger event will be generated when the ADC FIFO is almost full (3/4 full).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_NOT_EMPTY</name>
                  <value>0</value>
                  <description>UDMA0 trigger event will be generated when there are samples in the ADC FIFO.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SWEVSET</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Software Event Set

Set software event flags from AUX domain to AON and MCU domains. CPUs in MCU domain can read the event flags from EVTOAONFLAGS and clear them in EVTOAONFLAGSCLR.

Use of these event flags is software-defined.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SWEV2</name>
              <description>[2:2] Software event flag 2.

0: No effect.
1: Set software event flag 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SWEV1</name>
              <description>[1:1] Software event flag 1.

0: No effect.
1: Set software event flag 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SWEV0</name>
              <description>[0:0] Software event flag 0.

0: No effect.
1: Set software event flag 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOAONFLAGS</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Events To AON Flags

