seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
Sticky Request for Single Semaphore.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SMPH_ID</name>
              <description>[2:0] Write the semaphore ID,0x0-0x7, to SMPH_ID to request this semaphore until it is granted.

When semaphore SMPH_ID is granted, event  AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE becomes 1.

The event becomes 0 when software releases the semaphore or writes a new value to SMPH_ID.

To avoid corrupted semaphores:
- Usage of this functionality must be restricted to one CPU core.
- Software must wait until AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE is 1 before it writes a new value to SMPH_ID.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SYSIF</name>
      <baseAddress>0x400C6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX System Interface (AUX_SYSIF) is responsible for:
- system resource requests, such as power supply and clock requests.
- configuration of AUX peripheral operational rates for AUX_ANAIF DAC state machine and AUX_TIMER01.
- configuration of event synchronization rate for AUX_EVCTL:EVSTAT2 and AUX_EVCTL:EVSTAT3.

Peripheral operational rate for AUX modules mentioned above can either be:
- SCE rate, which is configured in AON_PMCTL:AUXSCECLK.
- AUX bus rate, which equals SCE rate or SCLK_HF divided by two when MCU domain is active or AUX operational mode is active.

AUX_SYSIF also interfaces AON_RTC to enable read access to data and sub-second increment control of AON_RTC.</description>
      <registers>
        <register>
          <name>OPMODEREQ</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Operational Mode Request

AUX can operate in three operational modes. Each mode is associated with:
- a SCE clock source or rate, given by AON_PMCTL:AUXSCECLK. This rate is termed SCE_RATE.
- a system power supply state request. AUX can request powerdown (uLDO) or active (GLDO or DCDC) system power supply state.

Follow these rules:
- It is not allowed to change a request until it has been acknowledged through OPMODEACK.
- A change in mode request must happen stepwise along this sequence, the direction is irrelevant:
   PDA - A - LP - PDLP.

Failure to follow these rules might result in unexpected behavior and must be avoided.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[1:0] AUX operational mode request.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDLP</name>
                  <value>3</value>
                  <description>Powerdown operational mode with wakeup to lowpower mode, characterized by:
- Powerdown system power supply state (uLDO) request.
- AON_PMCTL:AUXSCECLK.PD_SRC sets the SCE clock frequency (SCE_RATE).
- An active wakeup flag overrides the operational mode externally to lowpower (LP) as long as the flag is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDA</name>
                  <value>2</value>
                  <description>Powerdown operational mode with wakeup to active mode, characterized by:
- Powerdown system power supply state (uLDO) request.
- AON_PMCTL:AUXSCECLK.PD_SRC sets the SCE clock frequency (SCE_RATE).
- An active wakeup flag overrides the operational mode externally to active (A) as long as the flag is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <value>1</value>
                  <description>Lowpower operational mode, characterized by:
- Powerdown system power supply state (uLDO) request.
- SCE clock frequency (SCE_RATE) equals SCLK_MF.
- An active wakeup flag does not change operational mode.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <value>0</value>
                  <description>Active operational mode, characterized by:
- Active system power supply state (GLDO or DCDC) request.
- AON_PMCTL:AUXSCECLK.SRC sets the SCE clock frequency (SCE_RATE).
- An active wakeup flag does not change operational mode.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OPMODEACK</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Operational Mode Acknowledgement

User must assume that the current operational mode is the one acknowledged.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:0] AUX operational mode acknowledgement.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDLP</name>
                  <value>3</value>
                  <description>Powerdown operational mode with wakeup to lowpower mode is acknowledged.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDA</name>
                  <value>2</value>
                  <description>Powerdown operational mode with wakeup to active mode is acknowledged.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <value>1</value>
                  <description>Lowpower operational mode is acknowledged.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <value>0</value>
                  <description>Active operational mode is acknowledged.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSYNCRATE</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Event Synchronization Rate

Configure synchronization rate for certain events to the synchronous AUX event bus.

Select AUX bus rate when system CPU uses the event.

SCE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by two when MCU domain is active.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA_SYNC_RATE</name>
              <description>[2:2] Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPA event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPB_SYNC_RATE</name>
              <description>[1:1] Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPB event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PEROPRATE</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Peripheral Operational Rate

