seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 4. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 4 disabled
0x1: Compare and remap for comparator 4 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP5</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Comparator 5</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 5. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 5 disabled
0x1: Compare and remap for comparator 5 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP6</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Comparator 6</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Comparator 6 is a literal comparator and the only supported setting is 0x0. Other settings will be ignored.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 6. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 6 disabled
0x1: Compare and remap for comparator 6 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP7</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Comparator 7</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Comparator 7 is a literal comparator and the only supported setting is 0x0. Other settings will be ignored.

