seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
        <register>
          <name>STIM25</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Stimulus Port 25</description>
          <fields>
            <field>
              <name>STIM25</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA25 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM26</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Stimulus Port 26</description>
          <fields>
            <field>
              <name>STIM26</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA26 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM27</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>Stimulus Port 27</description>
          <fields>
            <field>
              <name>STIM27</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA27 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM28</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Stimulus Port 28</description>
          <fields>
            <field>
              <name>STIM28</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA28 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM29</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Stimulus Port 29</description>
          <fields>
            <field>
              <name>STIM29</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA29 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM30</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Stimulus Port 30</description>
          <fields>
            <field>
              <name>STIM30</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA30 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM31</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>Stimulus Port 31</description>
          <fields>
            <field>
              <name>STIM31</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA31 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TER</name>
          <addressOffset>0xe00</addressOffset>
          <size>32</size>
          <description>Trace Enable
Use the Trace Enable Register to generate trace data by writing to the corresponding stimulus port. Note: Privileged writes are accepted to this register if TCR.ITMENA is set. User writes are accepted to this register if TCR.ITMENA is set and the appropriate privilege mask is cleared. Privileged access to the stimulus ports enables an RTOS kernel to guarantee instrumentation slots or bandwidth as required.</description>
          <fields>
            <field>
              <name>STIMENA31</name>
              <description>[31:31] Bit mask to enable tracing on ITM stimulus port 31.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>STIMENA30</name>
              <description>[30:30] Bit mask to enable tracing on ITM stimulus port 30.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>STIMENA29</name>
              <description>[29:29] Bit mask to enable tracing on ITM stimulus port 29.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>STIMENA28</name>
              <description>[28:28] Bit mask to enable tracing on ITM stimulus port 28.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>STIMENA27</name>
              <description>[27:27] Bit mask to enable tracing on ITM stimulus port 27.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>STIMENA26</name>
              <description>[26:26] Bit mask to enable tracing on ITM stimulus port 26.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>STIMENA25</name>
              <description>[25:25] Bit mask to enable tracing on ITM stimulus port 25.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>STIMENA24</name>
              <description>[24:24] Bit mask to enable tracing on ITM stimulus port 24.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>STIMENA23</name>
              <description>[23:23] Bit mask to enable tracing on ITM stimulus port 23.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>STIMENA22</name>
              <description>[22:22] Bit mask to enable tracing on ITM stimulus port 22.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>STIMENA21</name>
              <description>[21:21] Bit mask to enable tracing on ITM stimulus port 21.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>STIMENA20</name>
              <description>[20:20] Bit mask to enable tracing on ITM stimulus port 20.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>STIMENA19</name>
              <description>[19:19] Bit mask to enable tracing on ITM stimulus port 19.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>STIMENA18</name>
              <description>[18:18] Bit mask to enable tracing on ITM stimulus port 18.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>STIMENA17</name>
              <description>[17:17] Bit mask to enable tracing on ITM stimulus port 17.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>STIMENA16</name>
              <description>[16:16] Bit mask to enable tracing on ITM stimulus port 16.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>STIMENA15</name>
              <description>[15:15] Bit mask to enable tracing on ITM stimulus port 15.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>STIMENA14</name>
              <description>[14:14] Bit mask to enable tracing on ITM stimulus port 14.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>STIMENA13</name>
              <description>[13:13] Bit mask to enable tracing on ITM stimulus port 13.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>STIMENA12</name>
              <description>[12:12] Bit mask to enable tracing on ITM stimulus port 12.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>STIMENA11</name>
              <description>[11:11] Bit mask to enable tracing on ITM stimulus port 11.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>STIMENA10</name>
              <description>[10:10] Bit mask to enable tracing on ITM stimulus port 10.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>STIMENA9</name>
              <description>[9:9] Bit mask to enable tracing on ITM stimulus port 9.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>STIMENA8</name>
              <description>[8:8] Bit mask to enable tracing on ITM stimulus port 8.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STIMENA7</name>
              <description>[7:7] Bit mask to enable tracing on ITM stimulus port 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>STIMENA6</name>
              <description>[6:6] Bit mask to enable tracing on ITM stimulus port 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>STIMENA5</name>
              <description>[5:5] Bit mask to enable tracing on ITM stimulus port 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>STIMENA4</name>
              <description>[4:4] Bit mask to enable tracing on ITM stimulus port 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>STIMENA3</name>
              <description>[3:3] Bit mask to enable tracing on ITM stimulus port 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STIMENA2</name>
              <description>[2:2] Bit mask to enable tracing on ITM stimulus port 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>STIMENA1</name>
              <description>[1:1] Bit mask to enable tracing on ITM stimulus port 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STIMENA0</name>
              <description>[0:0] Bit mask to enable tracing on ITM stimulus port 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TPR</name>
          <addressOffset>0xe40</addressOffset>
          <size>32</size>
          <description>Trace Privilege
This register is used to enable an operating system to control which stimulus ports are accessible by user code. This register can only be used in privileged mode.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PRIVMASK</name>
              <description>[3:0] Bit mask to enable unprivileged (User) access to ITM stimulus ports:

Bit [0] enables stimulus ports 0, 1, ..., and 7.
Bit [1] enables stimulus ports 8, 9, ..., and 15.
Bit [2] enables stimulus ports 16, 17, ..., and 23.
Bit [3] enables stimulus ports 24, 25, ..., and 31.

0: User access allowed to stimulus ports
1: Privileged access only to stimulus ports</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TCR</name>
          <addressOffset>0xe80</addressOffset>
          <size>32</size>
          <description>Trace Control
Use this register to configure and control ITM transfers. This register can only be written in privilege mode. DWT is not enabled in the ITM block. However, DWT stimulus entry into the FIFO is controlled by DWTENA. If DWT requires timestamping, the TSENA bit must be set.</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>BUSY</name>
              <description>[23:23] Set when ITM events present and being drained.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>ATBID</name>
              <description>[22:16] Trace Bus ID for CoreSight system. Optional identifier for multi-source trace stream formatting. If multi-source trace is in use, this field must be written with a non-zero value.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[15:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TSPRESCALE</name>
              <description>[9:8] Timestamp prescaler</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>3</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>2</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOPRESCALING</name>
                  <value>0</value>
                  <description>No prescaling</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[7:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SWOENA</name>
              <description>[4:4] Enables asynchronous clocking of the timestamp counter (when TSENA = 1). If TSENA = 0, writing this bit to 1 does not enable asynchronous clocking of the timestamp counter.

0x0: Mode disabled. Timestamp counter uses system clock from the core and counts continuously.
0x1: Timestamp counter uses lineout (data related) clock from TPIU interface. The timestamp counter is held in reset while the output line is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DWTENA</name>
              <description>[3:3] Enables the DWT stimulus (hardware event packet emission to the TPIU from the DWT)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SYNCENA</name>
              <description>[2:2] Enables synchronization packet transmission for a synchronous TPIU.
CPU_DWT:CTRL.SYNCTAP must be configured for the correct synchronization speed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TSENA</name>
              <description>[1:1] Enables differential timestamps. Differential timestamps are emitted when a packet is written to the FIFO with a non-zero timestamp counter, and when the timestamp counter overflows. Timestamps are emitted during idle times after a fixed number of two million cycles. This provides a time reference for packets and inter-packet gaps. If SWOENA (bit [4]) is set, timestamps are triggered by activity on the internal trace bus only. In this case there is no regular timestamp output when the ITM is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ITMENA</name>
              <description>[0:0] Enables ITM. This is the master enable, and must be set before ITM Stimulus and Trace Enable registers can be written.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LAR</name>
          <addressOffset>0xfb0</addressOffset>
          <size>32</size>
          <description>Lock Access
This register is used to prevent write accesses to the Control Registers: TER, TPR and TCR.</description>
          <fields>
            <field>
              <name>LOCK_ACCESS</name>
              <description>[31:0] A privileged write of 0xC5ACCE55 enables more write access to Control Registers TER, TPR and TCR. An invalid write removes write access.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LSR</name>
          <addressOffset>0xfb4</addressOffset>
          <size>32</size>
          <description>Lock Status
Use this register to enable write accesses to the Control Register.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>BYTEACC</name>
              <description>[2:2] Reads 0 which means 8-bit lock access is not be implemented.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ACCESS</name>
              <description>[1:1] Write access to component is blocked. All writes are ignored, reads are permitted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PRESENT</name>
              <description>[0:0] Indicates that a lock mechanism exists for this component.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
