seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA2</name>
              <description>[2:2] Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.

Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA1</name>
              <description>[1:1] Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.

Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA0</name>
              <description>[0:0] Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.

Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>KEYWRITTENAREA</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>Key Written Area Status
This register shows which areas of the key store RAM contain valid written keys.
When a new key needs to be written to the key store, on a location that is already occupied by a valid key, this key area must be cleared first. This can be done by writing this register before the new key is written to the key store memory.
Attempting to write to a key area that already contains a valid key is not allowed and will result in an error.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN7</name>
              <description>[7:7] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN6</name>
              <description>[6:6] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN5</name>
              <description>[5:5] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN4</name>
              <description>[4:4] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN3</name>
              <description>[3:3] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN2</name>
              <description>[2:2] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN1</name>
              <description>[1:1] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN0</name>
              <description>[0:0] On read this bit returns the key area written status.


This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>KEYSIZE</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>Key Size
This register defines the size of the keys that are written with DMA.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SIZE</name>
              <description>[1:0] Key size

When writing to this register, KEYWRITTENAREA will be reset.

Note: For the Crypto peripheral this field is fixed to 128 bits. For software compatibility KEYWRITTENAREA will  be reset when writing to this register.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128_BIT</name>
                  <value>1</value>
                  <description>128 bits</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>KEYREADAREA</name>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <description>Key Read Area</description>
          <fields>
            <field>
              <name>BUSY</name>
              <description>[31:31] Key store operation busy status flag (read only)

