seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
0: operation is completed.
1: operation is not completed and the key store is busy.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[30:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RAM_AREA</name>
              <description>[3:0] Selects the area of the key store RAM from where the key needs to be read that will be written to the AES engine.

Only RAM areas that contain valid written keys can be selected.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RAM</name>
                  <value>8</value>
                  <description>No RAM</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA7</name>
                  <value>7</value>
                  <description>RAM Area 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA6</name>
                  <value>6</value>
                  <description>RAM Area 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA5</name>
                  <value>5</value>
                  <description>RAM Area 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA4</name>
                  <value>4</value>
                  <description>RAM Area 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA3</name>
                  <value>3</value>
                  <description>RAM Area 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA2</name>
                  <value>2</value>
                  <description>RAM Area 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA1</name>
                  <value>1</value>
                  <description>RAM Area 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AREA0</name>
                  <value>0</value>
                  <description>RAM Area 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x8</resetValue>
        </register>
        <register>
          <name>AESKEY2</name>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <description>Clear AES_KEY2/GHASH Key</description>
          <fields>
            <field>
              <name>KEY2</name>
              <description>[31:0] AESKEY2.* bits 31+x:0+x or AES_GHASH_H.* bits 31+x:0+x, where x = 0, 32, 64, 96 ordered from the LSW entry of this 4-deep register array.
The interpretation of this field depends on the crypto operation mode.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESKEY3</name>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <description>Clear AES_KEY3</description>
          <fields>
            <field>
              <name>KEY3</name>
              <description>[31:0] AESKEY3.* bits 31+x:0+x or AESKEY2.* bits 159+x:128+x, where x = 0, 32, 64, 96 ordered from the LSW entry of this 4-deep register arrary.
The interpretation of this field depends on the crypto operation mode.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESIV</name>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <description>AES Initialization Vector</description>
          <fields>
            <field>
              <name>IV</name>
              <description>[31:0] The interpretation of this field depends on the crypto operation mode.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESCTL</name>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <description>AES Input/Output Buffer Control</description>
          <fields>
            <field>
              <name>CONTEXT_RDY</name>
              <description>[31:31] If 1, this status bit indicates that the context data registers can be overwritten and the Host is permitted to write the next context.  Writing a context means writing either a mode, the crypto length or AESDATALEN1.LEN_MSW, AESDATALEN0.LEN_LSW length registers</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>SAVED_CONTEXT_RDY</name>
              <description>[30:30] If read as 1, this status bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the Host to retrieve. This bit is only asserted if SAVE_CONTEXT is set to 1. The bit is mutually exclusive with CONTEXT_RDY.

Writing 1 clears the bit to zero, indicating the Crypto peripheral can start its next operation. This bit is also cleared when the 4th word of the output TAG and/or IV is read.

Note: All other mode bit writes will be ignored when this mode bit is written with 1.

Note: This bit is controlled automatically by the Crypto peripheral for TAG read DMA operations.

For typical use, this bit does NOT need to be written, but is used for status reading only. In this case, this status bit is automatically maintained by the Crypto peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>SAVE_CONTEXT</name>
              <description>[29:29] IV must be read before the AES engine can start a new operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>RESERVED25</name>
              <description>[28:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>CCM_M</name>
              <description>[24:22] Defines M that indicates the length of the authentication field for CCM operations; the authentication field length equals two times the value of CCM_M plus one.
Note: The Crypto peripheral always returns a 128-bit authentication field, of which the M least significant bytes are valid. All values are supported.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>CCM_L</name>
              <description>[21:19] Defines L that indicates the width of the length field for CCM operations; the length field in bytes equals the value of CMM_L plus one. All values are supported.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CCM</name>
              <description>[18:18] AES-CCM mode enable.
AES-CCM is a combined mode, using AES for both authentication and encryption.
Note: Selecting AES-CCM mode requires writing of AESDATALEN1.LEN_MSW and AESDATALEN0.LEN_LSW  after all other registers.
Note: The CTR mode bit in this register must also be set to 1 to enable AES-CTR; selecting other AES modes than CTR mode is invalid.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CBC_MAC</name>
              <description>[15:15] MAC mode enable.
The DIR bit must be set to 1 for this mode.
Selecting this mode requires writing the AESDATALEN1.LEN_MSW and AESDATALEN0.LEN_LSW registers after all other registers.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[14:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CTR_WIDTH</name>
              <description>[8:7] Specifies the counter width for AES-CTR mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128_BIT</name>
                  <value>3</value>
                  <description>128 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>96_BIT</name>
                  <value>2</value>
                  <description>96 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64_BIT</name>
                  <value>1</value>
                  <description>64 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BIT</name>
                  <value>0</value>
                  <description>32 bits</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTR</name>
              <description>[6:6] AES-CTR mode enable
This bit must also be set for CCM, when encryption/decryption is required.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CBC</name>
              <description>[5:5] CBC mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>KEY_SIZE</name>
              <description>[4:3] This field specifies the key size.
The key size is automatically configured when a new key is loaded via the key store module.
00 = N/A - reserved
01 = 128 bits
10 = N/A - reserved
11 = N/A - reserved
For the Crypto peripheral this field is fixed to 128 bits.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DIR</name>
              <description>[2:2] Direction.
0 : Decrypt operation is performed.
1 : Encrypt operation is performed.

This bit must be written with a 1 when CBC-MAC is selected.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>INPUT_RDY</name>
              <description>[1:1] If read as 1, this status bit indicates that the 16-byte AES input buffer is empty. The Host is permitted to write the next block of data.

Writing a 0 clears the bit to zero and indicates that the AES engine can use the provided input data block.

Writing a 1 to this bit will be ignored.

