seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
This bit defines when the TAMATCHR and TAPR registers are updated.

If the timer is disabled (CTL.TAEN = 0) when this bit is set, TAMATCHR and TAPR are updated when the timer is enabled.
If the timer is stalled (CTL.TASTALL = 1) when this bit is set, TAMATCHR and TAPR are updated according to the configuration of this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOUPDATE</name>
                  <value>1</value>
                  <description>Update TAMATCHR and TAPR, if used, on the next time-out.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLEUPDATE</name>
                  <value>0</value>
                  <description>Update TAMATCHR and TAPR, if used, on the next cycle.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAPWMIE</name>
              <description>[9:9] GPTM Timer A PWM Interrupt Enable
This bit enables interrupts in PWM mode on rising, falling, or both edges of the CCP output, as defined by the CTL.TAEVENT
In addition, when this bit is set and a capture event occurs, Timer A
automatically generates triggers to the DMA if the trigger capability is enabled by setting the CTL.TAOTE bit and the DMAEV.CAEDMAEN bit respectively.

0 Capture event interrupt is disabled.
1 Capture event interrupt is enabled.
This bit is only valid in PWM mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Interrupt is enabled.  This bit is only valid in PWM mode.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Interrupt is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAILD</name>
              <description>[8:8] GPT Timer A PWM Interval Load Write</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOUPDATE</name>
                  <value>1</value>
                  <description>Update the TAR register with the value in the TAILR register on the next timeout. If the prescaler is used, update the TAPS register with the value in the TAPR register on the next timeout.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLEUPDATE</name>
                  <value>0</value>
                  <description>Update the TAR register with the value in the TAILR register on the next clock cycle. If the pre-scaler is used, update the TAPS register with the value in the TAPR register on the next clock cycle.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TASNAPS</name>
              <description>[7:7] GPT Timer A Snap-Shot Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>If Timer A is configured in the periodic mode, the actual free-running value of Timer A is loaded at the time-out event into the GPT Timer A (TAR) register.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Snap-shot mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAWOT</name>
              <description>[6:6] GPT Timer A Wait-On-Trigger</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAIT</name>
                  <value>1</value>
                  <description>If Timer A is enabled (CTL.TAEN = 1), Timer A does not begin counting until it receives a trigger from the timer in the previous position in the daisy chain. This bit must be clear for GPT Module 0, Timer A. This function is valid for one-shot, periodic, and PWM modes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOWAIT</name>
                  <value>0</value>
                  <description>Timer A begins counting as soon as it is enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMIE</name>
              <description>[5:5] GPT Timer A Match Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>An interrupt is generated when the match value in TAMATCHR is reached in the one-shot and periodic modes.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>The match interrupt is disabled for match events. Additionally, output triggers on match events are prevented.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACDIR</name>
              <description>[4:4] GPT Timer A Count Direction</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UP</name>
                  <value>1</value>
                  <description>The timer counts up. When counting up, the timer starts from a value of 0x0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <value>0</value>
                  <description>The timer counts down.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAAMS</name>
              <description>[3:3] GPT Timer A Alternate Mode

Note: To enable PWM mode, you must also clear TACM and then configure TAMR field to 0x2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM</name>
                  <value>1</value>
                  <description>PWM mode is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_COMP</name>
                  <value>0</value>
                  <description>Capture/Compare mode is enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACM</name>
              <description>[2:2] GPT Timer A Capture Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDGTIME</name>
                  <value>1</value>
                  <description>Edge-Time mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGCNT</name>
                  <value>0</value>
                  <description>Edge-Count mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMR</name>
              <description>[1:0] GPT Timer A Mode

0x0 Reserved
0x1 One-Shot Timer mode
0x2 Periodic Timer mode
0x3 Capture mode
The Timer mode is based on the timer configuration defined by bits 2:0 in the CFG register</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <value>3</value>
                  <description>Capture mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIODIC</name>
                  <value>2</value>
                  <description>Periodic Timer mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_SHOT</name>
                  <value>1</value>
                  <description>One-Shot Timer mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TBMR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Timer B Mode</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TCACT</name>
              <description>[15:13] Timer Compare Action Select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRSET_ON_TO</name>
                  <value>7</value>
                  <description>Clear CCP output pin immediately and set on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETCLR_ON_TO</name>
                  <value>6</value>
                  <description>Set CCP output pin immediately and clear on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRTOG_ON_TO</name>
                  <value>5</value>
                  <description>Clear CCP output pin immediately and toggle on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETTOG_ON_TO</name>
                  <value>4</value>
                  <description>Set CCP output pin immediately and toggle on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_TO</name>
                  <value>3</value>
                  <description>Set CCP output pin on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_TO</name>
                  <value>2</value>
                  <description>Clear CCP output pin on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOG_ON_TO</name>
                  <value>1</value>
                  <description>Toggle State on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_CMP</name>
                  <value>0</value>
                  <description>Disable compare operations</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCINTD</name>
              <description>[12:12] One-Shot/Periodic Interrupt Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_TO_INTR</name>
                  <value>1</value>
                  <description>Mask Time-Out Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_TO_INTR</name>
                  <value>0</value>
                  <description>Normal Time-Out Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBPLO</name>
              <description>[11:11] GPTM Timer B PWM Legacy Operation

0  Legacy operation with CCP pin driven Low when the TBILR
register is reloaded after the timer reaches 0.

