seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IOC</name>
      <baseAddress>0x40081000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>IO Controller (IOC) - configures all the DIOs and resides in the MCU domain.

Note: Performing a write operation that includes IOC.IOCFGn.PORT_ID, may cause glitches on the IO. This can happen even if the write operation does not actually change the PORT_ID field (i.e. the write operation writes the same value as it already held) . This happens because the write operation triggers activities in the IOC that may, in some cases, cause glitches. To avoid glitches refrain from writing to this field other than when needed to actually change the PORT_ID value. Note that it is possible to write to parts of the IOCFGn register without writing to PORT_ID by using byte oriented writes to the parts of the register that do not contain PORT_ID.</description>
      <registers>
        <register>
          <name>IOCFG0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Configuration of DIO0</description>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>[30:30] 0: Input hysteresis disable
1: Input hysteresis enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>IE</name>
              <description>[29:29] 0: Input disabled
1: Input enabled

Note: If IO is configured for AUX   PORT_ID = 0x08, the enable will be ignored.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>[28:27] If DIO is configured GPIO or non-AON peripheral signals,  PORT_ID 0x00 or &gt;0x08:

00: No wake-up
01: No wake-up
10: Wakes up from shutdown if this pad is going low.
11: Wakes up from shutdown if this pad is going high.

If IO is configured for AON peripheral signals or AUX   PORT_ID 0x01-0x08, this register only sets wakeup enable or not.

00, 01: Wakeup disabled
10, 11: Wakeup enabled

Polarity is controlled from AON registers.

Note:When the MSB is set, the IOC will deactivate the output enable for the DIO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>IOMODE</name>
              <description>[26:24] IO Mode
Not applicable for IO configured for AON periph. signals and AUX   PORT_ID 0x01-0x08
AUX has its own open_source/drain configuration.

0x2: Reserved. Undefined behavior.
0x3: Reserved. Undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPENSRC_INV</name>
                  <value>7</value>
                  <description>Open Source
Inverted input/output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENSRC</name>
                  <value>6</value>
                  <description>Open Source
Normal input / outut</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR_INV</name>
                  <value>5</value>
                  <description>Open Drain
Inverted input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR</name>
                  <value>4</value>
                  <description>Open Drain,
Normal input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <value>1</value>
                  <description>Inverted input / ouput</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <value>0</value>
                  <description>Normal input / output</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>[23:23] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG2 event
1: Input edge detection asserts AON_PROG2 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>[22:22] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG1 event
1: Input edge detection asserts AON_PROG1 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>[21:21] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG0 event
1: Input edge detection asserts AON_PROG0 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>RESERVED19</name>
              <description>[20:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>[18:18] 0: No interrupt generation
1: Enable interrupt generation for this IO (Only effective if EDGE_DET is enabled)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>[17:16] Enable generation of edge detection events on this IO</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>Positive and negative edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS</name>
                  <value>2</value>
                  <description>Positive edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>1</value>
                  <description>Negative edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No edge detection</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>[15:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>[14:13] Pull control</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>3</value>
                  <description>No pull</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>2</value>
                  <description>Pull up</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWN</name>
                  <value>1</value>
                  <description>Pull down</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>[12:12] 0: Normal slew rate
1: Enables reduced slew rate in output driver.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>IOCURR</name>
              <description>[11:10] Selects IO current mode of this IO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_8MA</name>
                  <value>2</value>
                  <description>Extended-Current (EC) mode: Min 8 mA for double drive strength IOs (min 4 mA for normal IOs) when IOSTR is set to AUTO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MA</name>
                  <value>1</value>
                  <description>High-Current (HC) mode: Min 4 mA when IOSTR is set to AUTO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MA</name>
                  <value>0</value>
                  <description>Low-Current (LC) mode: Min 2 mA when IOSTR is set to AUTO</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSTR</name>
              <description>[9:8] Select source for drive strength control of this IO.
This setting controls the drive strength of the Low-Current (LC) mode. Higher drive strength can be selected in IOCURR</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <value>3</value>
                  <description>Maximum drive strength, controlled by AON_IOC:IOSTRMAX (min 2 mA @1.8V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <value>2</value>
                  <description>Medium drive strength, controlled by AON_IOC:IOSTRMED (min 2 mA @2.5V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <value>1</value>
                  <description>Minimum drive strength, controlled by AON_IOC:IOSTRMIN (min 2 mA @3.3V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <value>0</value>
                  <description>Automatic drive strength, controlled by AON BATMON based on battery voltage. (min 2 mA @VDDS)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>[7:7] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert RTC event
1: Input edge detection asserts RTC event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>[6:6] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert MCU_WU event
1: Input edge detection asserts MCU_WU event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>[5:0] Selects usage for DIO0
Note: This field should not be written other than the times when PORT_ID value is specifically required to change.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFC_SMI_CL_IN</name>
                  <value>56</value>
                  <description>RF Core SMI Command Link In</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_CL_OUT</name>
                  <value>55</value>
                  <description>RF Core SMI Command Link Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_IN</name>
                  <value>54</value>
                  <description>RF Core SMI Data Link In</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_OUT</name>
                  <value>53</value>
                  <description>RF Core SMI Data Link Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI1</name>
                  <value>52</value>
                  <description>RF Core Data In 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI0</name>
                  <value>51</value>
                  <description>RF Core Data In 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO3</name>
                  <value>50</value>
                  <description>RF Core Data Out 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO2</name>
                  <value>49</value>
                  <description>RF Core Data Out 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO1</name>
                  <value>48</value>
                  <description>RF Core Data Out 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO0</name>
                  <value>47</value>
                  <description>RF Core Data Out 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_TRC</name>
                  <value>46</value>
                  <description>RF Core Trace</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_MCLK</name>
                  <value>41</value>
                  <description>I2S MCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_BCLK</name>
                  <value>40</value>
                  <description>I2S BCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_WCLK</name>
                  <value>39</value>
                  <description>I2S WCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD1</name>
                  <value>38</value>
                  <description>I2S Data 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD0</name>
                  <value>37</value>
                  <description>I2S Data 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_SWV</name>
                  <value>32</value>
                  <description>CPU SWV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <value>30</value>
                  <description>PORT EVENT 7
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <value>29</value>
                  <description>PORT EVENT 6
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <value>28</value>
                  <description>PORT EVENT 5
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <value>27</value>
                  <description>PORT EVENT 4
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <value>26</value>
                  <description>PORT EVENT 3
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <value>25</value>
                  <description>PORT EVENT 2
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <value>24</value>
                  <description>PORT EVENT 1
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <value>23</value>
                  <description>PORT EVENT 0
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <value>18</value>
                  <description>UART0 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <value>17</value>
                  <description>UART0 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <value>16</value>
                  <description>UART0 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX</name>
                  <value>15</value>
                  <description>UART0 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MSSCL</name>
                  <value>14</value>
                  <description>I2C Clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MSSDA</name>
                  <value>13</value>
                  <description>I2C Data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_CLK</name>
                  <value>12</value>
                  <description>SSI0 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_FSS</name>
                  <value>11</value>
                  <description>SSI0 FSS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_TX</name>
                  <value>10</value>
                  <description>SSI0 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_RX</name>
                  <value>9</value>
                  <description>SSI0 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_IO</name>
                  <value>8</value>
                  <description>AUX IO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_CLK32K</name>
                  <value>7</value>
                  <description>AON 32 KHz clock (SCLK_LF)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <value>0</value>
                  <description>General Purpose IO</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x6000</resetValue>
        </register>
        <register>
          <name>IOCFG1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Configuration of DIO1</description>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>[30:30] 0: Input hysteresis disable
1: Input hysteresis enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>IE</name>
              <description>[29:29] 0: Input disabled
1: Input enabled

Note: If IO is configured for AUX   PORT_ID = 0x08, the enable will be ignored.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>[28:27] If DIO is configured GPIO or non-AON peripheral signals,  PORT_ID 0x00 or &gt;0x08:

00: No wake-up
01: No wake-up
10: Wakes up from shutdown if this pad is going low.
11: Wakes up from shutdown if this pad is going high.

If IO is configured for AON peripheral signals or AUX   PORT_ID 0x01-0x08, this register only sets wakeup enable or not.

00, 01: Wakeup disabled
10, 11: Wakeup enabled

Polarity is controlled from AON registers.

