seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

Can be forced on by CRYPTO_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SECDMACLKGS</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>SEC (TRNG And CRYPTO) And UDMA Clock Gate For Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>[8:8] 0: Disable clock
1: Enable clock

Can be forced on by SECDMACLKGR.DMA_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>[1:1] 0: Disable clock
1: Enable clock

Can be forced on by SECDMACLKGR.TRNG_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

Can be forced on by SECDMACLKGR.CRYPTO_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SECDMACLKGDS</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>SEC (TRNG and CRYPTO) And UDMA Clock Gate For Deep Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>[8:8] 0: Disable clock
1: Enable clock

Can be forced on by SECDMACLKGR.DMA_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>[1:1] 0: Disable clock
1: Enable clock

SYSBUS clock will always run when enabled

Can be forced on by SECDMACLKGR.TRNG_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

SYSBUS clock will always run when enabled

Can be forced on by SECDMACLKGR.CRYPTO_AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIOCLKGR</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>GPIO Clock Gate For Run And All Modes</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[8:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  GPIOCLKGS.CLK_EN and  GPIOCLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

