seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UARTCLKGR</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>UART Clock Gate For Run And All Modes</description>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[9:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  UARTCLKGS.CLK_EN and  UARTCLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written

NOTE:
MSB is reserverd
Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AM_UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written

NOTE:
MSB is reserverd
Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UARTCLKGS</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>UART Clock Gate For Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by UARTCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written

NOTE:
MSB is reserverd
Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AM_UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UARTCLKGDS</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>UART Clock Gate For Deep Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by UARTCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written

NOTE:
MSB is reserverd
Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AM_UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SSICLKGR</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>SSI Clock Gate For Run And All Modes</description>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[9:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  SSICLKGS.CLK_EN and  SSICLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written

