seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
Memories controlled: CPERAM  MCERAM  RFERAM  DSBRAM</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>VIMS</name>
              <description>[1:0] 0: Memory retention disabled
1: Memory retention enabled

Bit 0: VIMS_TRAM
Bit 1: VIMS_CRAM

Legal modes depend on settings in VIMS:CTL.MODE

00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to CACHE or SPLIT mode after waking up again
01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain in GPRAM mode after wake up, alternatively select OFF mode first and then CACHE or SPILT mode.
10: Illegal mode
11: No restrictions</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>OSCIMSC</name>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <description>Oscillator Interrupt Mask Control</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HFSRCPENDIM</name>
              <description>[7:7] 0: Disable interrupt generation when HFSRCPEND is qualified
1: Enable interrupt generation when HFSRCPEND is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>LFSRCDONEIM</name>
              <description>[6:6] 0: Disable interrupt generation when LFSRCDONE is qualified
1: Enable interrupt generation when LFSRCDONE is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>XOSCDLFIM</name>
              <description>[5:5] 0: Disable interrupt generation when XOSCDLF is qualified
1: Enable interrupt generation when XOSCDLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>XOSCLFIM</name>
              <description>[4:4] 0: Disable interrupt generation when XOSCLF is qualified
1: Enable interrupt generation when XOSCLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RCOSCDLFIM</name>
              <description>[3:3] 0: Disable interrupt generation when RCOSCDLF is qualified
1: Enable interrupt generation when RCOSCDLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RCOSCLFIM</name>
              <description>[2:2] 0: Disable interrupt generation when RCOSCLF is qualified
1: Enable interrupt generation when RCOSCLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSCHFIM</name>
              <description>[1:1] 0: Disable interrupt generation when XOSCHF is qualified
1: Enable interrupt generation when XOSCHF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RCOSCHFIM</name>
              <description>[0:0] 0: Disable interrupt generation when RCOSCHF is qualified
1: Enable interrupt generation when RCOSCHF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x36</resetValue>
        </register>
        <register>
          <name>OSCRIS</name>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <description>Oscillator Raw Interrupt Status</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HFSRCPENDRIS</name>
              <description>[7:7] SCLK_HF source switch pending interrupt.

After a write to DDI_0_OSC:CTL0.SCLK_HF_SRC_SEL leads to a SCLK_HF source change request, then the requested SCLK_HF source will be enabled and qualified. When the new source is ready to be used as a clock source, then the interrupt HSSRCPENDRIS will go high. When the Flash allows SCLK_HF source switching to take place after flash memory read access is disabled. At this time the actual SCLK_HF clock source switch will be performed, and the interrupt status HSSRCPENDRIS will go low.

0: Indicates SCLK_HF source is not ready to be switched
1: Indicates SCLK_HF source is ready to be switched

Interrupt is qualified regardless of OSCIMSC.HFSRCPENDIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt.

Set by HW. Cleared by writing to OSCICR.HFSRCPENDC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>LFSRCDONERIS</name>
              <description>[6:6] SCLK_LF source switch done.

The DDI_0_OSC:CTL0.SCLK_LF_SRC_SEL  register field is used to request that the SCLK_LF source shall be changed. After an SCLK_LF clock source change is requested, the new source may need to be enabled and qualified before switching of clock source can be done. The interrupt LFRSRCDONERIS goes high to indicate that the SCLK_LF clock source switching has been performed. LFRSRCDONERIS will go low again when the next clock source change is requested by writing to DDI_0_OSC:CTL0.SCLK_LF_SRC_SEL .

