seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
        <register>
          <name>ICR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Interrupt Clear
On a write of 1, the corresponding interrupt is cleared. A write of 0 has no effect.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTIC</name>
              <description>[1:1] Clear the receive timeout interrupt:
Writing 1 to this field clears the timeout interrupt (RIS.RTRIS). Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORIC</name>
              <description>[0:0] Clear the receive overrun interrupt:
Writing 1 to this field clears the overrun error interrupt (RIS.RORRIS). Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>DMA Control</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>[1:1] Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>[0:0] Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESERVED1</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESERVED2</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TRNG</name>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>True Random Number Generator</description>
      <registers>
        <register>
          <name>OUT0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Random Number Lower Word Readout Value</description>
          <fields>
            <field>
              <name>VALUE_31_0</name>
              <description>[31:0] LSW of 64- bit random value. New value ready when IRQFLAGSTAT.RDY = 1.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OUT1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Random Number Upper Word Readout Value</description>
          <fields>
            <field>
              <name>VALUE_63_32</name>
              <description>[31:0] MSW of 64-bit random value. New value ready when IRQFLAGSTAT.RDY = 1.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQFLAGSTAT</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Interrupt Status</description>
          <fields>
            <field>
              <name>NEED_CLOCK</name>
              <description>[31:31] 1: Indicates that the TRNG is busy generating entropy or is in one of its test modes - clocks may not be turned off and the power supply voltage must be kept stable.
0: TRNG is idle and can be shut down</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[30:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>[1:1] 1: The number of FROs shut down (i.e. the number of '1' bits in the ALARMSTOP register) has exceeded the threshold set by ALARMCNT.SHUTDOWN_THR

Writing '1' to IRQFLAGCLR.SHUTDOWN_OVF clears this bit to '0' again.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RDY</name>
              <description>[0:0] 1: Data are available in OUT0 and OUT1.

Acknowledging this state by writing '1' to IRQFLAGCLR.RDY clears this bit to '0'.
If a new number is already available in the internal register of the TRNG, the number is directly clocked into the result register. In this case the status bit is asserted again, after one clock cycle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQFLAGMASK</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Interrupt Mask</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>[1:1] 1: Allow IRQFLAGSTAT.SHUTDOWN_OVF to activate the interrupt from this module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RDY</name>
              <description>[0:0] 1: Allow IRQFLAGSTAT.RDY to activate the interrupt from this module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQFLAGCLR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Interrupt Flag Clear</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>[1:1] 1: Clear IRQFLAGSTAT.SHUTDOWN_OVF.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RDY</name>
              <description>[0:0] 1: Clear IRQFLAGSTAT.RDY.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Control</description>
          <fields>
            <field>
              <name>STARTUP_CYCLES</name>
              <description>[31:16] This field determines the number of samples (between 2^8 and 2^24) taken to gather entropy from the FROs during startup. If the written value of this field is zero, the number of samples is 2^24, otherwise the number of samples equals the written value times 2^8.

0x0000: 2^24 samples
0x0001: 1*2^8 samples
0x0002: 2*2^8 samples
0x0003: 3*2^8 samples
...
0x8000: 32768*2^8 samples
0xC000: 49152*2^8 samples
...
0xFFFF: 65535*2^8 samples

This field can only be modified while TRNG_EN is 0. If 1 an update will be ignored.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[15:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>TRNG_EN</name>
              <description>[10:10] 0: Forces all TRNG logic back into the idle state immediately.
1: Starts TRNG, gathering entropy from the FROs for the number of samples determined by STARTUP_CYCLES.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[9:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>NO_LFSR_FB</name>
              <description>[2:2] 1: Remove XNOR feedback from the main LFSR, converting it into a normal shift register for the XOR-ed outputs of the FROs (shifting data in on the LSB side). A '1' also forces the LFSR to sample continuously.

