seanmlyons22/ti-lprf-pacs/svds/cc13x1_cc26x1.svd
Read as:

Bit [Ch] = 0: uDMA channel Ch responds to both burst and single requests on channel C. The controller performs 2^R, or single, bus transfers.

Bit [Ch] = 1: uDMA channel Ch does not respond to single transfer requests. The controller only responds to burst transfer requests and performs 2^R transfers.

Write as:
Bit [Ch] = 0: No effect. Use the CLEARBURST.CHNLS to set bit [Ch] to 0.
Bit [Ch] = 1: Disables single transfer requests on channel Ch. The controller performs 2^R transfers for burst requests.

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLEARBURST</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Channel Clear UseBurst</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Set the appropriate bit to enable single transfer requests.

Write as:

Bit [Ch] = 0: No effect. Use the SETBURST.CHNLS to disable single transfer requests.

Bit [Ch] = 1: Enables single transfer requests on channel Ch.

Writing to a bit where a DMA channel is not implemented has no effect.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SETREQMASK</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Channel Set Request Mask</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Returns the burst and single request mask status, or disables the corresponding channel from generating uDMA requests.

Read as:
Bit [Ch] = 0: External requests are enabled for channel Ch.
Bit [Ch] = 1: External requests are disabled for channel Ch.

Write as:
Bit [Ch] = 0: No effect. Use the CLEARREQMASK.CHNLS to enable uDMA requests.
Bit [Ch] = 1: Disables uDMA burst request channel [C] and uDMA single request channel [C] input from generating uDMA requests.

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLEARREQMASK</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Clear Channel Request Mask</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Set the appropriate bit to enable DMA request for the channel.

Write as:
Bit [Ch] = 0: No effect. Use the SETREQMASK.CHNLS to disable channel C from generating requests.
Bit [Ch] = 1: Enables channel [C] to generate DMA requests.

Writing to a bit where a DMA channel is not implemented has no effect.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SETCHANNELEN</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Set Channel Enable</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Returns the enable status of the channels, or enables the corresponding channels.

Read as:
Bit [Ch] = 0: Channel Ch is disabled.
Bit [Ch] = 1: Channel Ch is enabled.

Write as:
Bit [Ch] = 0: No effect. Use the CLEARCHANNELEN.CHNLS to disable a channel
Bit [Ch] = 1: Enables channel Ch

Writing to a bit where a DMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLEARCHANNELEN</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Clear Channel Enable</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Set the appropriate bit to disable the corresponding uDMA channel.

Write as:
Bit [Ch] = 0: No effect. Use the SETCHANNELEN.CHNLS to enable uDMA channels.
Bit [Ch] = 1: Disables channel Ch

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SETCHNLPRIALT</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Channel Set Primary-Alternate</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Returns the channel control data structure status, or selects the alternate data structure for the corresponding uDMA channel.

Read as:
Bit [Ch] = 0: uDMA channel Ch is using the primary data structure.
Bit [Ch] = 1: uDMA channel Ch is using the alternate data structure.

Write as:
Bit [Ch] = 0: No effect. Use the CLEARCHNLPRIALT.CHNLS to disable a channel
Bit [Ch] = 1: Selects the alternate data structure for channel Ch

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLEARCHNLPRIALT</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Channel Clear Primary-Alternate</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Clears the appropriate bit to select the primary data structure for the corresponding uDMA channel.

Write as:
Bit [Ch] = 0: No effect. Use the SETCHNLPRIALT.CHNLS to select the alternate data structure.
Bit [Ch] = 1: Selects the primary data structure for channel Ch.

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SETCHNLPRIORITY</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Set Channel Priority</description>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Returns the channel priority mask status, or sets the channel priority to high.

